[{"reviewerID": "A34IZTX1ZGG1D7", "asin": "B0000479VM", "reviewerName": "Alberto Kiramoto", "helpful": [0, 0], "reviewText": "Better then the new model, but still a pain to install and dont work all the time. But still better then the other that breaks the head all the time. If it does not work all the time why do it?", "overall": 2.0, "summary": "Latches are better then the other \"new model from Safety First\"", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"},
{"reviewerID": "A1CJRC68K1O5I5", "asin": "B0000479VM", "reviewerName": "Al", "helpful": [1, 1], "reviewText": "I installed these on 6 of my kitchen cupboards and they are terrible.  They are real flimsy plastic that warps when you tighten the screws.  One broke in a week and the others keep going out of alignment so they hit the door and stop it from shutting.I bought one made by Parents Magazine and it is excellent.  It is strong, has adhesive tape to hold it in place while installing the screws and folds down for when you don't need them anymore but might have more children later.", "overall": 1.0, "summary": "Terrible", "unixReviewTime": 1195344000, "reviewTime": "11 18, 2007"},
{"reviewerID": "ALW9RQZEIQXQJ", "asin": "B0000479VM", "reviewerName": "Booyaacpn \"Booyaacpn\"", "helpful": [0, 0], "reviewText": "We tried using these latches on various drawers and doors.  They never worked well.  Our two-year old found she could still get by them if she opened them quickly.  They don't seem to grab well and are very difficult to install.", "overall": 2.0, "summary": "not satisfactory", "unixReviewTime": 1219622400, "reviewTime": "08 25, 2008"},
{"reviewerID": "A3PZQC93JVRS1W", "asin": "B0000479VM", "reviewerName": "disappointed father", "helpful": [2, 3], "reviewText": "I usually don't take the time to write reviews, but this product is so bad I had to. I just don't want other parents to buy and waste time installing. For the most part, they don't latch at all...and even when they do, they warp in 5-10 openings/closings of a drawer. SO DISAPPOINTED IN THIS PRODUCT. IT IS JUST A GIANT PIECE OF ____. PLEASE DON'T BUY'EM.", "overall": 1.0, "summary": "TERRIBLE PRODUCT!!!", "unixReviewTime": 1240790400, "reviewTime": "04 27, 2009"},
{"reviewerID": "A1LNJK0KOAK0AL", "asin": "B0000479VM", "reviewerName": "Gator", "helpful": [6, 6], "reviewText": "These work, but they are more difficult to use than competitor's.  They are wider, so they're sturdier, but it makes it more difficult to push down to get the cabinet/drawer to open.  Also, if you have used older versions, the holes to screw these in don't match, either on the latches or the catch.  Also, they are so long, little hands can pry the cabinet open far enough to get inside unless you put the catch so far back inside that then it's in the way of whatever you have inside the cabinet.  We think the child safety cabinet latch by Prime-Line are a much easier and equally effective solution.", "overall": 1.0, "summary": "There are better choices", "unixReviewTime": 1207440000, "reviewTime": "04 6, 2008"},
{"reviewerID": "AUCFJKU8HUWWZ", "asin": "B0000479VM", "reviewerName": "Ice", "helpful": [0, 1], "reviewText": "Latches work great, but they are a little difficult to install on existing cabinets.  Would be easy if the cabinet was being assembled at the time of installation.", "overall": 4.0, "summary": "time consuming", "unixReviewTime": 1168473600, "reviewTime": "01 11, 2007"},

{"reviewerID": "A3PQTEK1MCKICP", "asin": "B0000479VM", "reviewerName": "J. Lehto", "helpful": [0, 0], "reviewText": "Personally I found these a hassle to install, ignore the included directions and break out your drill to make pilot holes.  Also difficult to adjust alignment side-to-side, so drill the holes right!  Works great for cabinets once installed correctly.  I gave up on installing them in drawers.", "overall": 3.0, "summary": "Cheap, effective on cabinets, annoying install", "unixReviewTime": 1186704000, "reviewTime": "08 10, 2007"},
{"reviewerID": "A312D7EYAT7UK1", "asin": "B0000479VM", "reviewerName": "joni", "helpful": [0, 0], "reviewText": "These are one of the worst items I have ever spent money on not only a they a pain to put on but after standing on your head to do it they don't work! They are too narrow if your drawers shift side to side a tiny bit it won't catch. Why on earth wouldn't they make them wider I do not know.I wouldn't have given one star but there is no 0 rating.These are crap save your money and time. Very mad!", "overall": 1.0, "summary": "safety 1st drawer latches", "unixReviewTime": 1368403200, "reviewTime": "05 13, 2013"},
{"reviewerID": "A1XLORE3W5DPDR", "asin": "B0000479VM", "reviewerName": "Kelsey Connolly", "helpful": [0, 0], "reviewText": "Installing these was probably the hardest and most frustrating thing I have ever done in my life. I regret my purchase and will probably find some that are better to install in the rest of the house.", "overall": 1.0, "summary": "Only got 1 installed", "unixReviewTime": 1378944000, "reviewTime": "09 12, 2013"},
{"reviewerID": "A1M21GB0SP8AUH", "asin": "B0000479VM", "reviewerName": "Michael James Walsh", "helpful": [1, 1], "reviewText": "These are a waste of money. We bought them thinking the adhesives would be good enough for installation and it doesn't even adhere for more than 5 minutes. The latch is long and awkward, so not even sure how it works given the angle when opening the door.", "overall": 1.0, "summary": "Terrible", "unixReviewTime": 1297468800, "reviewTime": "02 12, 2011"},
{"reviewerID": "A3FNQFHRM3LWAC", "asin": "B0000479VM", "reviewerName": "Nantol \"nantol3\"", "helpful": [11, 11], "reviewText": "My daughter loves to play in the bathroom drawers, so we installed these latches. Turns out that the latches are too long. She can still open the drawers wide enough to get her little hands inside. They work great on cabinets, however.", "overall": 3.0, "summary": "Great for cabinets, not for drawers", "unixReviewTime": 1125964800, "reviewTime": "09 6, 2005"},
{"reviewerID": "A1Q296204EGMQ1", "asin": "B0000479VM", "reviewerName": "Nich", "helpful": [0, 2], "reviewText": "These are the best latches I've used so far. They are sturdy and are the only ones that my infant hasn't managed to operate!  The pack I got didn't have any adhesive strips, so I used double-sided tape to help me get them lined up right before drilling the holes.  I have tried several other types of latches and they are all flimsy and easily conquered by my infant.", "overall": 4.0, "summary": "Best so far", "unixReviewTime": 1189036800, "reviewTime": "09 6, 2007"},
{"reviewerID": "A1L943STVMOFR3", "asin": "B0000479VM", "reviewerName": "P. Wahlberg", "helpful": [0, 0], "reviewText": "the adhesive strips are nice for holding things in place while you get everything screwed on.", "overall": 4.0, "summary": "work well", "unixReviewTime": 1240444800, "reviewTime": "04 23, 2009"},
{"reviewerID": "AJXNVIFUORYGZ", "asin": "B0000479VM", "reviewerName": "Rachael Thomas", "helpful": [2, 2], "reviewText": "These latches work pretty well so long as you can install the catch piece far enough back on the cabinet door frame that the door, when latched, doesn't open wide enough for little hands to squeeze through.  I had to remove and re-install the first one I tried because my son could easily fit his hands through the gap.  They work nicely once you get them installed properly.  Unfortunatley, they're a nightmare to install.  My kitchen cabinets are made of a very hard composite material and I broke a drill bit off trying to drill holes for the screws.  The latch won't work if it's not perfectly aligned, so it takes some time to position the pieces.  They do include sticky pads to help with this, but the pads didn't seem to want to stick to my cabinets and I ended up getting my husband to hold the pieces while I put in the screws.", "overall": 3.0, "summary": "Takes some patience.", "unixReviewTime": 1182729600, "reviewTime": "06 25, 2007"},
{"reviewerID": "A1WRHH79XKYIZY", "asin": "B0000479VM", "reviewerName": "Rodgers", "helpful": [0, 0], "reviewText": "These are good when positioned correctly, but it is a little difficult to do so precisely enough to make them work properly. You really have to position them perfectly.", "overall": 3.0, "summary": "OK", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"},
{"reviewerID": "A3VP33LYPBGGR", "asin": "B0000479VM", "reviewerName": "Rosy Nelson \"Rosy\"", "helpful": [4, 5], "reviewText": "We bought this and the first time we tried the opening the drawer these broke. We then replaced them, but just to watch my 16 month toddler to open and break the latch on his first try. Very disappointing. We had to replace all the drawer latches with another brand. Don't waste your time.", "overall": 1.0, "summary": "Breaks Easily", "unixReviewTime": 1186963200, "reviewTime": "08 13, 2007"},
{"reviewerID": "A1LBWLRQIFOSFF", "asin": "B0000479VM", "reviewerName": "S. Chambers", "helpful": [0, 0], "reviewText": "I couldn't even get these installed on my archaic cabinets or drawers....grrr. I guess 20 years ago cabinets were actually made out of solid wood!", "overall": 1.0, "summary": "Impossible installation", "unixReviewTime": 1248048000, "reviewTime": "07 20, 2009"},
{"reviewerID": "A20EHF8UA4LDWA", "asin": "B0000479VM", "reviewerName": "Shauna Cedillos \"Mama Shauna\"", "helpful": [3, 3], "reviewText": "I got these latches about a month ago, and they are a big improvement on the old type of latch. these ones actually catch, where the old ones could easily be stripped open, even by the kids. I like that they come with an adhesive so you can place them. make sure you have a drill bit to drill out the holes before screwing the screws in... makes it loads easier and faster. I installed the whole package in about an hour. the first latch I put on 3 times before I had it lined up right. It is a little tricky, but once you do it, the rest are a breeze. They have worked out great so far, and are very durable. They are easy to unlatch, my school aged children can do it... but the baby cannot figure it out. You should see the look on my daughter's face when she can no longer open the cabinet doors:)", "overall": 4.0, "summary": "Better than the old type", "unixReviewTime": 1179360000, "reviewTime": "05 17, 2007"},
{"reviewerID": "APTGC7O9SS2QA", "asin": "B0000479VM", "reviewerName": "T. H. Rogers \"historybuff\"", "helpful": [1, 1], "reviewText": "We purchased these--fairly easy to install as long as you have a drill.  Keeping baby out so far.  Used when tot locks were to hard to locate with magnet-better than them by far.", "overall": 3.0, "summary": "so far, so good", "unixReviewTime": 1169942400, "reviewTime": "01 28, 2007"}]